Table of Contents
 Class ConcreteSetupEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Concrete setup Ec2
public class ConcreteSetupEc2 : ConcreteSetup
Inheritance
object
OpenObject
OpenElementId
ConcreteSetup
ConcreteSetupEc2
Inherited Members
 ConcreteSetup.SetupValues
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Annex
Annex code
public NationalAnnexCode Annex { get; set; }
Property Value
NationalAnnexCode
 Nad
Nad strategy
public NadStrategyConcrete Nad { get; set; }
Property Value
NadStrategyConcrete
 Edit this page